In [1]:
import pandas as pd

print(pd.__version__)

2.2.3

In [2]:
scores = pd.Series([85, 92, 78, 96], index=['김철수', '이영희', '박민수', '최지연'])
print(scores)

김철수    85
이영희    92
박민수    78
최지연    96
dtype: int64

In [4]:
print(scores['이영희'])

92

In [12]:
high_stu = scores[scores>=90]
print(high_stu)

이영희    92
최지연    96
dtype: int64

In [14]:
plus_score = scores + 5
print(plus_score)

김철수     90
이영희     97
박민수     83
최지연    101
dtype: int64

In [16]:
# 학생 정보를 DataFrame으로 생성
stu = {
    '이름': ['김철수', '이영희', '박민수', '최지연'],
    '나이': [20, 19, 21, 20],
    '성별': ['남', '여', '남', '여'],
    '점수': [85, 92, 78, 96]
}
df = pd.DataFrame(stu)
print(df)

    이름  나이 성별  점수
0  김철수  20  남  85
1  이영희  19  여  92
2  박민수  21  남  78
3  최지연  20  여  96

In [ ]:
# DataFrame의 기본 정보
print(df.info())

# DataFrame의 통계 요약 정보
print(df.describe())

# DataFrame의 행, 열 개수
print(df.shape)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      4 non-null      object
 1   나이      4 non-null      int64
 2   성별      4 non-null      object
 3   점수      4 non-null      int64
dtypes: int64(2), object(2)
memory usage: 260.0+ bytes
None
              나이         점수
count   4.000000   4.000000
mean   20.000000  87.750000
std     0.816497   7.932003
min    19.000000  78.000000
25%    19.750000  83.250000
50%    20.000000  88.500000
75%    20.250000  93.000000
max    21.000000  96.000000
(4, 4)

In [22]:
print(df.head(2))

    이름  나이 성별  점수
0  김철수  20  남  85
1  이영희  19  여  92

In [23]:
print(df['점수'])

0    85
1    92
2    78
3    96
Name: 점수, dtype: int64

In [ ]:
print(df.loc[df['이름'] == '이영희'])

    이름  나이 성별  점수
1  이영희  19  여  92

In [27]:
print(df.iloc[0:3:2][['이름', '점수']])

    이름  점수
0  김철수  85
2  박민수  78

In [28]:
df20 = df[df['나이']==20]
print(df20)

    이름  나이 성별  점수
0  김철수  20  남  85
3  최지연  20  여  96

In [ ]:
new_df = df.copy()
new_df.loc[4] = ['정민호',22,'남',88]
print(new_df)

    이름  나이 성별  점수
0  김철수  20  남  85
1  이영희  19  여  92
2  박민수  21  남  78
3  최지연  20  여  96
4  정민호  22  남  88

In [ ]:
new_df['점수'] = new_df['점수']+3
print(new_df)

    이름  나이 성별  점수
0  김철수  20  남  88
1  이영희  19  여  95
2  박민수  21  남  81
3  최지연  20  여  99
4  정민호  22  남  91

In [32]:
def get_grade(df):
    if df['점수']>=90:
        return 'A'
    elif df['점수']>=80:
        return 'B'
    else:
        return 'C'

new_df['등급'] = new_df.apply(get_grade, axis=1)
print(new_df)

    이름  나이 성별  점수 등급
0  김철수  20  남  88  B
1  이영희  19  여  95  A
2  박민수  21  남  81  B
3  최지연  20  여  99  A
4  정민호  22  남  91  A

In [39]:
import pandas as pd

# 샘플 데이터 생성
sales_data = {
    '주문번호': ['ORD001', 'ORD002', 'ORD003', 'ORD004', 'ORD005', 'ORD006'],
    '고객명': ['김철수', '이영희', '박민수', '김철수', '최지연', '이영희'],
    '상품명': ['노트북', '마우스', '키보드', '모니터', '노트북', '스피커'],
    '가격': [1200000, 25000, 80000, 300000, 1350000, 120000],
    '수량': [1, 2, 1, 1, 1, 1],
    '주문일': ['2024-01-15', '2024-01-16', '2024-01-16', '2024-01-17', '2024-01-17', '2024-01-18']
}

df_sales = pd.DataFrame(sales_data)

In [40]:
df_sales['구매 금액'] = df_sales['가격'] * df_sales['수량']
total = sum(df_sales['구매 금액'])
total

3100000

In [ ]:
customer = df_sales.groupby('고객명').agg({'주문번호':'count', '구매 금액':'sum'}).reset_index()
customer = customer.rename(columns={'주문번호':'주문 횟수', '구매 금액':'고객별 구매 금액'})
print(customer)

   고객명  주문 횟수  고객별 구매 금액
0  김철수      2    1500000
1  박민수      1      80000
2  이영희      2     170000
3  최지연      1    1350000

In [48]:
max_sales = df_sales[df_sales['수량'] == df_sales['수량'].max()]
print(max_sales)

     주문번호  고객명  상품명     가격  수량         주문일  구매 금액
1  ORD002  이영희  마우스  25000   2  2024-01-16  50000

In [49]:
daily_sales = df_sales.groupby('주문일').agg({'주문번호':'count', '구매 금액':'sum'}).reset_index()
daily_sales = daily_sales.rename(columns={'주문번호':'일별 주문수', '구매 금액':'일별 매출'})
print(daily_sales)

          주문일  일별 주문수    일별 매출
0  2024-01-15       1  1200000
1  2024-01-16       2   130000
2  2024-01-17       2  1650000
3  2024-01-18       1   120000

In [50]:
sales_10 = df_sales[df_sales['가격']>=100000]
print(sales_10)

     주문번호  고객명  상품명       가격  수량         주문일    구매 금액
0  ORD001  김철수  노트북  1200000   1  2024-01-15  1200000
3  ORD004  김철수  모니터   300000   1  2024-01-17   300000
4  ORD005  최지연  노트북  1350000   1  2024-01-17  1350000
5  ORD006  이영희  스피커   120000   1  2024-01-18   120000

In [53]:
import numpy as np

# 결측치가 있는 데이터
messy_data = {
    '이름': ['A', 'B', 'C', 'D', 'E'],
    '나이': [25, np.nan, 30, 28, np.nan],
    '점수': [85, 90, np.nan, 95, 88]
}

df_messy = pd.DataFrame(messy_data)
df_messy

  이름    나이    점수
0  A  25.0  85.0
1  B   NaN  90.0
2  C  30.0   NaN
3  D  28.0  95.0
4  E   NaN  88.0

In [54]:
df_messy.isnull()

      이름     나이     점수
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False
4  False   True  False

In [62]:
df_messy['나이'] = df_messy['나이'].fillna(df_messy['나이'].mean().round(0))
df_messy

  이름  나이    점수
0  A  25  85.0
1  B  27  90.0
2  C  30   NaN
3  D  28  95.0
4  E  27  88.0

In [63]:
df_messy['점수'] = df_messy['점수'].fillna(df_messy['점수'].median())
df_messy

  이름  나이    점수
0  A  25  85.0
1  B  27  90.0
2  C  30  89.0
3  D  28  95.0
4  E  27  88.0

In [64]:
# 학생 기본정보
students = pd.DataFrame({
    '학번': ['S001', 'S002', 'S003'],
    '이름': ['김철수', '이영희', '박민수'],
    '학과': ['컴퓨터공학', '통계학', '경영학']
})

# 학생 성적정보
scores = pd.DataFrame({
    '학번': ['S001', 'S002', 'S003'],
    '수학': [85, 92, 78],
    '영어': [88, 85, 90]
})

In [65]:
merged_df = pd.merge(students, scores, on='학번')
merged_df

     학번   이름     학과  수학  영어
0  S001  김철수  컴퓨터공학  85  88
1  S002  이영희    통계학  92  85
2  S003  박민수    경영학  78  90

In [67]:
merged_df['평균'] = ((merged_df['수학'] + merged_df['영어'])/2).round(2)
merged_df

     학번   이름     학과  수학  영어    평균
0  S001  김철수  컴퓨터공학  85  88  86.5
1  S002  이영희    통계학  92  85  88.5
2  S003  박민수    경영학  78  90  84.0